[{"symbol":"kmpec_crew","name":"K'mpec","rarity":5,"portrait":"crew_portraits_cm_kmpec_sm.webp","fullBody":"crew_full_body_cm_kmpec_full.webp","leftImg":true,"note":"*Slaps roof of Timelines* This bad boy can fit so many Klingon Politicians in it.\r\n\r\nToo much time spent studying Klingon politics will make your eyes cross. If you covered the nameplates of the different Chancellors, it would be nearly impossible to tell them apart. That means two things in practical terms; none of them stand out apart from Gowron's gauntlet ability and if you love K'mpec, you might want to grab a copy before he becomes impossible to 100% retrieve.\r\n\r\nIf you do own a copy or three of K'mpec from his event or the recaps of an otherwise statistically impressive mega, we advise a slow burn fusion process consisting of him saving your bacon in otherwise poor beholds. He's an alright collection/event combo piece, but offers nothing statistically significant or unique in any corner of the game.","traits":["Klingon","Politician","Duelist","Brutal","Veteran"],"collections":["Heh Cho'mruak tah","Valor in Combat"],"date":"2021-12-01T20:53:29.134927+01:00","primary":{"skill":"cmd","base":1566,"min":296,"max":611},"secondary":{"skill":"sec","base":1181,"min":220,"max":467},"tertiary":{"skill":"dip","base":563,"min":105,"max":213},"rawPrimary":{"skill":"cmd","base":1253,"min":239,"max":493},"rawSecondary":{"skill":"sec","base":953,"min":176,"max":374},"rawTertiary":{"skill":"dip","base":451,"min":88,"max":178},"tier":6,"voyage":6.97,"voyageR":140,"gauntlet":5.53,"gauntletR":189,"event":6.76,"eventR":352,"shuttle":5.34,"shuttleR":194,"coll":5.8,"collR":243,"arena":3.28,"arenaR":308},{"symbol":"patar_crew","name":"Patar","rarity":4,"portrait":"crew_portraits_cm_patar_sm.webp","fullBody":"crew_full_body_cm_patar_full.webp","leftImg":false,"note":"To boil things down to brass tacks, just as Patar would want it, this card has strong voyage and base metrics with a collection attached. A galaxy event was the right place to debut her and new players will benefit most from her four copies, while established rosters will take the perfunctory notch on the Vulcan collection for their weekend efforts.","traits":["Vulcan","Tactician","Federation","Starfleet","Section 31"],"collections":["Live Long and Prosper"],"date":"2021-12-01T20:53:29.1329154+01:00","primary":{"skill":"dip","base":1173,"min":176,"max":403},"secondary":{"skill":"cmd","base":701,"min":142,"max":321},"tertiary":{"skill":"eng","base":512,"min":57,"max":140},"rawPrimary":{"skill":"dip","base":939,"min":147,"max":336},"rawSecondary":{"skill":"cmd","base":561,"min":115,"max":259},"rawTertiary":{"skill":"eng","base":410,"min":48,"max":117},"tier":5,"voyage":8.59,"voyageR":19,"gauntlet":3.23,"gauntletR":715,"event":8.19,"eventR":91,"shuttle":9.26,"shuttleR":21,"coll":2.83,"collR":369,"arena":3.91,"arenaR":252},{"symbol":"burnham_resistance_crew","name":"Resistance Burnham","rarity":5,"portrait":"crew_portraits_cm_burnham_resistance_sm.webp","fullBody":"crew_full_body_cm_burnham_resistance_full.webp","leftImg":true,"note":"One of two bookend CMD/DIP/SEC giveaway crew in 2021, on the heels of another CDS Burnham variant, on the heels of back to back CDS mega recurring crew, sandwiched between CDS event crew... Suffice it to say, if you stay current with Timelines, Resistance Burnham is a crew you don't need.\r\n\r\nWith Burnham's voyage power lagging behind all of the aforementioned CDS crew from around the time of her release, the only reason she should be making more than one or two runs for you is because of fusion level, not on her own merits. And if you're reading this by the time she enters the portal, then you *really* shouldn't be shelling out behold capital for this part of her game.\r\n\r\nThat being said, Burnham is eternal and the same boring skill set that smothers the voyage ranks never hurts for shuttle seating. As the top Burnham DIP option she will be useful, if replaceable, in that area. With her traits not giving her much event help and capping her potential collection value, Resistance is primarily an event piece that doesn't cover new ground.","traits":["Federation","Starfleet","Xenoanthropology","Human","Duelist","Resourceful"],"collections":["Original Thinking"],"date":"2021-12-01T00:42:27.125Z","obtained":"N/A","primary":{"skill":"cmd","base":1593,"min":274,"max":527},"secondary":{"skill":"dip","base":1283,"min":122,"max":286},"tertiary":{"skill":"sec","base":582,"min":91,"max":240},"rawPrimary":{"skill":"cmd","base":1275,"min":221,"max":425},"rawSecondary":{"skill":"dip","base":1027,"min":102,"max":239},"rawTertiary":{"skill":"sec","base":470,"min":73,"max":192},"tier":7,"voyage":6.75,"voyageR":167,"gauntlet":4.25,"gauntletR":480,"event":7.26,"eventR":273,"shuttle":6.75,"shuttleR":88,"coll":4.65,"collR":330,"arena":4.84,"arenaR":85},{"symbol":"picard_fencing_crew","name":"Fencing Picard","rarity":5,"portrait":"crew_portraits_cm_picard_fencing_sm.webp","fullBody":"crew_full_body_cm_picard_fencing_full.webp","leftImg":false,"note":"\"Number One, my voyage partner's cancelled for this afternoon. I was wondering if you wanted to join me?\"\n\"Voyaging? I'm really not very good.\"\n\"It doesn't matter so long as you *tsch tsch tsch tsch* enjoy it.\" :)\n\nLet's see how hard we can bury the lede. Picard catches a bit of flak for not towering over everyone else's event tally, especially considering his absurd number of variants, but he's notched at least two bonuses every year dating back to 2017. With a handful of traits to bolster his ability there and a skill set made for shuttle seating, he'll be a reliable weekend performer for years.\n\nThose traits also give him a reasonable chance to expand his collection value, with his floor there being a spot in the ginormous Resourceful collection. They even give him a few bites at the gauntlet pie as he owns over twenty elevated crit gauntlets, including a few at 45%. Heavy skill set competition limits his effectiveness there, but it's a nice boon for newer rosters.\n\nSeven of his eight traits even show up for anti-matter bonuses, which comes in handy for the number one freakin voyager! Braxton's thirty-four month reign as \"The Only Crew Who Matters\" has come to an end and despite Fencing's done to death skill set, his raw power is unmatched and will venture outside of the CMD/DIP/SUCK bubble more frequently than any other crew in his skill set. Fencing is a fairly well rounded crew and his astonishing voyage power alone is worth the price of admission.","traits":["Human","Starfleet","Federation","Tactician","Resourceful","Duelist","Astrophysicist","Athlete"],"collections":["Original Thinking"],"date":"2021-11-30T00:00:00Z","obtained":"Pack","primary":{"skill":"sec","base":1556,"min":283,"max":627},"secondary":{"skill":"cmd","base":1217,"min":271,"max":503},"tertiary":{"skill":"dip","base":766,"min":136,"max":285},"rawPrimary":{"skill":"sec","base":1255,"min":227,"max":502},"rawSecondary":{"skill":"cmd","base":974,"min":219,"max":406},"rawTertiary":{"skill":"dip","base":613,"min":114,"max":238},"tier":1,"voyage":10,"voyageR":1,"gauntlet":5.99,"gauntletR":129,"event":7.99,"eventR":119,"shuttle":5.04,"shuttleR":221,"coll":5.22,"collR":287,"arena":3.28,"arenaR":309},{"symbol":"ancient_humanoid_crew","name":"Ancient Humanoid","rarity":5,"portrait":"crew_portraits_cm_ancient_humanoid_sm.webp","fullBody":"crew_full_body_cm_ancient_humanoid_full.webp","leftImg":true,"note":"If mom tells you we have Ancient Humanoid at home and tries to stick you with Changeling Founder, don't listen! Humanoid is a few gauntlet rolls away from the daily use trifecta, but still brings it for base and voyages to keep her in frequent rotation as a strong option.\r\n\r\nDethroning a Picard is big news considering WRG's (Ben's) love affair with him and so Humanoid's debut as the top SCI base in the game (by a small margin) should win her a few fans who notice the former mega recurring crew bumped down the shuttle selection window. Her stats are allocated for such a purpose, also besting Pupcard's secondary and tertiary, elevating Humanoid into 'best SCI shuttler' territory.\r\n\r\nNot a one hit wonder, we have some impressive voyage metrics coming from this crew as well. Her top ten overall debut comes pre-loaded with a handful of valuable anti-matter traits that aren't flush with options like HFS. Despite the ordinary skill set, she's still among the best to wear it and should age far better than other mid-level debuts like Humanoid Figure.\r\n\r\nJens' collection floor of two and ceiling of five is about right for your average crew and worth even more attached to a daily use option like this. By the time she might fall out of service for you, she should have collected a few more spots in stat-boosters and cements her as the sort of event name that you save up your chrons and shuttle boosts to obtain.","traits":["Communicator","Geneticist","Hologram","Survivalist","Cultural Figure"],"collections":["Cultural Impact","Survival Training"],"date":"2021-12-02T00:00:00Z","obtained":"Event","primary":{"skill":"sci","base":1622,"min":303,"max":540},"secondary":{"skill":"dip","base":1257,"min":182,"max":302},"tertiary":{"skill":"cmd","base":782,"min":62,"max":181},"rawPrimary":{"skill":"sci","base":1330,"min":251,"max":447},"rawSecondary":{"skill":"dip","base":1006,"min":152,"max":252},"rawTertiary":{"skill":"cmd","base":626,"min":50,"max":146},"tier":2,"voyage":8.48,"voyageR":24,"gauntlet":4.26,"gauntletR":479,"event":9.3,"eventR":9,"shuttle":8.35,"shuttleR":20,"coll":6.56,"collR":156,"arena":2.96,"arenaR":400},{"symbol":"kira_prophet_crew","name":"Prophet Kira","rarity":5,"portrait":"crew_portraits_cm_kira_prophet_sm.webp","fullBody":"crew_full_body_cm_kira_prophet_full.webp","leftImg":false,"note":"One half of the long-awaited 'DBZ in space' fusion crew has arrived in the game. Somewhat mis-labeled as a 'gauntlet crew', Kira is more of an all-rounder, at least at this stage of her lifespan. \r\n\r\nProphet has the requisite voyage power for a two-to-three year usability profile starting at release on many rosters, but two black marks against her are an awful skill set and the unfortunate timing of being released in the midst of so many other CMD/DIP/SUCK options, most of them superior. There's a chance that when WRG fixes her erroneous Federation and Starfleet traits, they upgrade them with the Duelist and Cultural Figure tags she deserves - hopefully that occurs while she's still a voyage option.\r\n\r\nA surprisingly relevant event option for a card with 'gauntlet crew' bases, Kira is the picture of consistency when it comes to event bonuses and has only dipped below four features in a calendar year once. If the aforementioned trait changes are made, that would only enhance her weekend shuttle work which includes perhaps the juiciest skill order possible for shuttle seating.\r\n\r\nIn order to get paid our three cents per word, we've kept gauntlet for last. Kira does boast worthwhile overall power and a good single roll - good enough to be an option in most of her 25% gauntlets. Unfortunately, her crit is capped at that amount and her skill set is ultra competitive. If you pick her up while you're still Balok-less or to avoid Kahless' price tag, she'll put in more work for you than she would on a \"complete\" roster, but she's at least an occasional option for everyone.","traits":["Bajoran","Prophet","Duelist","Spiritual","Maverick"],"date":"2021-11-25T00:00:00Z","obtained":"Event","primary":{"skill":"sec","base":1275,"min":372,"max":876},"secondary":{"skill":"cmd","base":1221,"min":198,"max":580},"tertiary":{"skill":"dip","base":576,"min":175,"max":364},"rawPrimary":{"skill":"sec","base":1029,"min":298,"max":701},"rawSecondary":{"skill":"cmd","base":977,"min":160,"max":468},"rawTertiary":{"skill":"dip","base":461,"min":146,"max":304},"tier":3,"voyage":7.64,"voyageR":70,"gauntlet":7.3,"gauntletR":34,"event":8.23,"eventR":75,"shuttle":4.39,"shuttleR":342,"coll":2.1,"collR":470,"arena":3.3,"arenaR":301},{"symbol":"quarren_kyrian_crew","name":"Quarren of the Kyrian","rarity":4,"portrait":"crew_portraits_cm_quarren_kyrian_sm.webp","fullBody":"crew_full_body_cm_quarren_kyrian_full.webp","leftImg":true,"note":"Quarren's clumsy name and discombobulated trait set are a big distraction from good debut metrics and make for a card which may look a lot different should they ever fix the latter.\r\n\r\nHe debuted with top ten voyage and top five base metrics, establishing him as a juicy early game target for those lucky enough to snag him from his event. Despite lacking typically valuable long term attributes for a super rare, Quarren fits his role well for players who can fuse him up early in their journey and his non-standard trait set, 'correct' or not, may pay dividends in the future.","traits":["Casual","Exoarchaeology","Linguist","Historian"],"date":"2021-12-02T00:00:00Z","obtained":"Event","primary":{"skill":"sci","base":1154,"min":211,"max":425},"secondary":{"skill":"eng","base":762,"min":130,"max":300},"tertiary":{"skill":"dip","base":428,"min":90,"max":176},"rawPrimary":{"skill":"sci","base":946,"min":175,"max":352},"rawSecondary":{"skill":"eng","base":610,"min":109,"max":250},"rawTertiary":{"skill":"dip","base":343,"min":75,"max":147},"tier":8,"voyage":8.26,"voyageR":30,"gauntlet":3.22,"gauntletR":718,"event":3.88,"eventR":417,"shuttle":8,"shuttleR":177,"coll":2.82,"collR":370,"arena":3.8,"arenaR":277},{"symbol":"sahil_lieutenant_crew","name":"Lieutenant Sahil","rarity":5,"portrait":"crew_portraits_cm_sahil_lieutenant_sm.webp","fullBody":"crew_full_body_cm_sahil_lieutenant_full.webp","leftImg":false,"note":"Our listening post lost all its glow\nThe day that it lost you\nBut he gained all his glitter the day you said go\nAnd his silver turned to blue\n\nMr. Blue announced his arrival with a bang, bringing hope and inspiration to couch potatoes everywhere. No matter how many decades you've spent in the same room, you too can be recognized as the greatest explorer of your generation.\n\nFor crew who debut at this power level, skill set matters less. While the concept of 'value over replacement' still exists, Sahil doesn't have much competition for daily voyages and where he does, in steps a six-pack of anti-matter traits. When the rank projections have a crew inside the top ten after a year and top twenty after two, you smash that acquire button and let the other chips fall where they may.\n\nA front loaded crew, Sahil lacks broader utility, but does manage to pick up multi-collection status thanks to the very generously applied Resourceful trait and should be able to hit his perceived ceiling with a third collection. He may catch a mega or two down the line as tie-ins to selling collection-themed packs, but bet on the Leftenant for his tangible, day one voyage and collection value and accept anything else as bonus.","traits":["Human","Inspiring","Federation","Starfleet","Resourceful","Communicator"],"collections":["Original Thinking","To Boldly Go"],"date":"2021-12-02T00:00:00Z","obtained":"Event","primary":{"skill":"dip","base":1590,"min":310,"max":612},"secondary":{"skill":"cmd","base":1180,"min":225,"max":478},"tertiary":{"skill":"sec","base":770,"min":130,"max":255},"rawPrimary":{"skill":"dip","base":1272,"min":259,"max":510},"rawSecondary":{"skill":"cmd","base":944,"min":182,"max":386},"rawTertiary":{"skill":"sec","base":621,"min":104,"max":204},"tier":2,"voyage":9.48,"voyageR":5,"gauntlet":5.67,"gauntletR":172,"event":6.31,"eventR":407,"shuttle":6.16,"shuttleR":130,"coll":6.27,"collR":197,"arena":2.9,"arenaR":418}]