[{"symbol":"mitchell_crew","name":"Lt. Commander Mitchell","rarity":5,"portrait":"crew_portraits_cm_mitchell_sm.png","fullBody":"crew_full_body_cm_mitchell_full.png","leftImg":true,"note":"Mitchell is a gauntlet experiment that failed before it began. Out of place item and proficiency ranges \"are as intended\", but stand at odds with a crew truly usable in the gauntlet. If minimum rolls didn't exist, Antaak and 1-skill Chapel would be marauding around regularly. In the real world, where gauntlet's coin flip nature is already frustrating enough, you would be doing yourself no favors by bringing 'the bad Gary' along.\nA true to life trait set unfortunately doesn't do much to buoy Mitchell's rolls; he only catches a single 45%+ gauntlet, during which will be the only time any of his proficiency pairs sneak into the top twenty. A letdown elsewhere as well, his traits trigger no collections (yet), have him behind multiple anti-matter options in every possible seat on voyages, and only Pilot has provided more than one-off event work.","bbLink":"https://docs.google.com/spreadsheets/d/1CYR5jnqtacbQM9MIsXp6ATs84Q3rbRM3SmKmUtBvlJ0/edit#gid=0\u0026range=A495","traits":["Human","Federation","Starfleet","Brutal","Pilot","Telekinetic","Telepath"],"primary":{"skill":"cmd","base":1488,"min":14,"max":858},"secondary":{"skill":"sec","base":1169,"min":22,"max":591},"tertiary":{"skill":"dip","base":589,"min":83,"max":178},"tier":7,"voyage":8.43,"voyageR":209,"gauntlet":6.52,"gauntletR":271,"event":6.15,"eventR":412,"shuttle":4.01,"shuttleR":240},{"symbol":"picard_evsuit_crew","name":"EV Suit Picard","rarity":5,"portrait":"crew_portraits_cm_picard_evsuit_sm.png","fullBody":"crew_full_body_cm_picard_evsuit_full.png","leftImg":false,"note":"A gauntlet card that slightly improves upon Braxton, EV Suit Picard will only make more lineups due its coolness factor. That improvement only consists of a minor increase in CMD and ENG average rolls as neither card gets above 25% crit. This confines him to CMD/ENG utility with plenty of competition from higher crit crew.\nIt is also unfortunate that the first ENG on a Picard comes as a secondary skill on a gauntlet card. However, that should still earn him a seat on one of the rarer shuttles in typical Picard events.\nThe only worthy mention for the voyager EV Suit Picard is his Astrophysicist seat which no one else in this skill set can fill with a trait match. But it is only mildly useful until you retrieve Captain Braxton or purchase the recently added Honor Hall crew.","bbLink":"https://docs.google.com/spreadsheets/d/1CYR5jnqtacbQM9MIsXp6ATs84Q3rbRM3SmKmUtBvlJ0/edit#gid=0\u0026range=A489","traits":["Human","Federation","Starfleet","Astrophysicist","Inspiring","Tactician"],"collections":["A Little Stroll","To Boldly Go"],"primary":{"skill":"cmd","base":1286,"min":289,"max":922},"secondary":{"skill":"eng","base":1080,"min":255,"max":547},"tertiary":{"skill":"sec","base":535,"min":97,"max":248},"tier":3,"voyage":8.35,"voyageR":234,"gauntlet":8.59,"gauntletR":15,"event":7.57,"eventR":204,"shuttle":3.09,"shuttleR":449},{"symbol":"burnham_captain_crew","name":"Captain Burnham","rarity":5,"portrait":"crew_portraits_cm_captain_burnham_sm.png","fullBody":"crew_full_body_cm_captain_burnham_full.png","leftImg":true,"note":"To borrow an expression, why does this crew need to be? We'll get to her standalone merits in a moment, but as a Burnham variant, she brings nothing to the table that can't be obtained in better amounts elsewhere.\nDebuting as the third best CMD base for Burnham's dependable event history, her strong overall ranking is somewhat muted by being tethered to a character which covers that skill quite well on shuttles already. And the CMD/DIP/SUCK skill set makes Cap'n Burnham victim number 200-something, neutering an already mediocre power level for a new crew release.\nThat being said, there is readily apparent value in a crew who gets Burnham's time in the spotlight with a strong base and worthwhile collection spot. She will earn shuttle work (and some short-lived voyage fill-ins), just be aware that those are more or less secondary benefits for a character that you like and that there are more useful options out there if you're looking purely at gameplay potential.","bbLink":"https://docs.google.com/spreadsheets/d/1CYR5jnqtacbQM9MIsXp6ATs84Q3rbRM3SmKmUtBvlJ0/edit#gid=0\u0026range=A479","traits":["Federation","Starfleet","Human","Resourceful","Inspiring","Xenoanthropology","Explorer"],"collections":["To Boldly Go","Original Thinking"],"primary":{"skill":"cmd","base":1600,"min":215,"max":495},"secondary":{"skill":"dip","base":993,"min":193,"max":376},"tertiary":{"skill":"sec","base":702,"min":115,"max":251},"tier":5,"voyage":8.48,"voyageR":193,"gauntlet":6.16,"gauntletR":389,"event":7.26,"eventR":259,"shuttle":6.88,"shuttleR":58}]